Repository: panchal-h/hp12
Catalog: SmartLibrary.Resources/Messages.*.resx
Languages: ar

# AccessDeniedMessage
source: Access Denied. Please contact the administrator.
ar: تم رفض الولوج. يُرجى الاتصال بالمسؤول.

# ChangePasswordError
source: Error in changing password.
ar: خطأ في تغيير كلمة المرور.

# DeleteErrorMessage
source: {0} is already in use. You cannot delete this {0}.
ar: {0} قيد الاستخدام بالفعل. لا يمكنك حذف هذا.

# DeleteMessage
source: {0} has been deleted successfully.
ar: {0} تم حذفه بنجاح.

# DuplicateMessage
source: Duplicate {0} is not allowed.
ar: نسخ {0} غير مسموح.

# EmailRequired
source: Please Enter Email Addresss
ar: يُرجى إدخال عنوان البريد الإلكتروني

# EmailSent
source: Email successfully Sent
ar: تم إرسال البريد الإلكتروني بنجاح

# ErrorMessage
source: An error occurred while processing your request.
ar: حدث خطأ أثناء معالجة طلبك.

# InvalidFieldMessage
source: {0} is not valid.
ar: {0} غير صالح.

# InvalidInputMessage
source: Input Not Valid
ar: المُدخل غير صالح

# InvalidISBNMessage
source: Invalid ISBN.
ar: الرقم الدولي المعياري للكتاب (ISBN) غير صالح.

# InvalidUrlMessage
source: URL is not valid.
ar: رابط URL غير صالح.

source: No Record Found
ar: لا يوجد سجلات

# NotAuthorizedMeesage
source: You are not authorized to access this page.<br> If you require to access this page, Please contact system administrator.
ar: أنت غير مخوّل بالولوج إلى هذه الصفحة. <br> إذا كنت ترغب في الولوج إلى هذه الصفحة، يُرجى الاتصال بمسؤول النظام.

# PasswordEmailSendFail
source: Email Failed
ar: فشل البريد الإلكتروني

# RequiredFieldMessage
source: {0} is required.
ar: {0} مطلوب.

# RestrictIllegalCharacters
source: Illegal characters in string!
ar: السلسلة تحتوي على حروف غير صحيحة!

# SaveMessage
source: {0} saved successfully.
ar: تم حفظ {0} بنجاح.

# SessionExpiredMessage
source: Your session has been expired, You will redirect to login page.
ar: انتهت صلاحية جلسة العمل الخاصة بك، وسيتم إعادة توجيهك إلى صفحة تسجيل الدخول.

# StringLengthMessage
source: Maximum length should be {1}
ar: ينبغي أن لا يتجاوز عدد الحروف {1}

# SuccessMessage
source: Your operation is successfully done.
ar: تم إجراء العملية الخاصة بك بنجاح.

# UpdateMessage
source: {0} updated successfully.
ar: تم تحديث {0} بنجاح.

# UrlExpiredMessage
source: The URL is no longer valid.
ar: لم يعد رابط URL صالحًا.

# UserAccountNotmatched
source: We couldn't find an account matching the user account you entered. Please check your detail and try again.
ar: تعذر العثور على حساب متطابق مع حساب المستخدم الذي أدخلته. يُرجى التحقق من التفاصيل الخاصة بك ثم إعادة المحاولة.

# NoInactiveMessage
source: {0} is already in use so you cannot Inactive this.
ar: {0} قيد الاستخدام حتى لا تتمكن من استخدام هذا غير نشط.

# RequiredBookCoverImage
source: Book Cover Image is required.
ar: صورة غلاف الكتاب مطلوبة.

# MemberAlreadyRegistered
source: Member is already register to the site
ar: العضو مُسجل بالفعل في هذا الموقع.

# InvalidBookTotalQuantityMessage
source: {0} books are borrowed. {1} must be more than or equal to {0}.
ar: {0} كتب تمت استعارتها. {1} لا بد أن يكون أكبر من أو مساويًا لـ {0}.

# ISBNFetchSuccess
source: Book Detail Fetch Successfully.
ar: تم إحضار تفاصيل الكتاب بنجاح.

# AddBookInterest
source: Book has been added to Favourite
ar: تمت إضافة الكتاب إلى المجموعة المفضلة

# RemoveBookInterest
source: Book has been removed from Favourite
ar: تم حذف الكتاب من المفضلة

source: Book Status
ar: حالة الكتاب

# InvalidImageMessage
source: Please select valid image.
ar: يُرجى تحديد صورة صالحة.

# PasswordLengthMessageMinMax
source: Password length must be between {2} and {1}
ar: طول كلمة المرور لا بد أن يكون بين {2} و {1}

# BookPeriodMessage
source: Here is period for which you want to borrow the book.
ar: هنا تظهر الفترة التي ترغب في استعارة الكتاب خلالها.

# BorrowBookHeader
source: Here you can request for the book which you want to borrow.
ar: هنا يمكنك طلب الكتاب الذي ترغب في استعارته.

# BorrowBookAdd
source: Your book is borrowed successfully. Waiting for administrator Approval.
ar: تمت استعارة كتابك بنجاح. حاليًا في انتظار موافقة المسؤول.

# BorrowBookError
source: Error in Borrowing Book.
ar: خطأ في استعارة الكتاب.

# ApproveRejectBorrowedBook
source: Borrowed Book is Successfully {0}.
ar: الكتب المُستعارة بنجاح {0}.

# ErrorApproveRejectBorrowedBook
source: Error in {0} Borrowed Book.
ar: خطأ في {0} كتاب مُستعار.

# BookNotAvailable
source: Sorry, Book is not available.
ar: عذرًا، الكتاب غير متوفر.

# AllPasswordRequired
source: Please fill all password details to change your password
ar: يُرجى ملء جميع تفاصيل كلمة المرور لتغيير كلمة المرور الخاصة بك

# BookingAreaUnavailable
source: Selected booking area is unavailable for selected time.
ar: مساحة الحجز المُحددة غير متوفرة أثناء الوقت المُحدد.

# NoOfAttendeeExceedCapacity
source: Booking area capacity is {0}. {1} must be less than or equal to {0}.
ar: سعة مساحة الحجز {0}. {1} لا بد أن تكون أقل من أو مساوية لـ {0}.

# AddComment
source: Your comment has added.
ar: تمت إضافة تعليقك.

# InvalidRangeMessage
source: {0} value must be between {1} and {2}.
ar: قيمة {0} لا بد أن تكون بين {1} و {2}.

# SpaceBookingTimeMessage
source: Space booking period must be in future.
ar: لا بد أن تكون فترة حجز الحيّز في المستقبل.

# TimeCompareMessage
source: {0} must be greater than {1}.
ar: {0} لا بد أن يكون أكبر من {1}.

# ApproveSpaceBookingStatus
source: Space Booking has been {0}.
ar: تم حجز الحيّز {0}.

# AlreadyBookBorrowed
source: This book is already Borrowed.
ar: هذا الكتاب مُستعار بالفعل.

# SpaceBookingReschedule
source: Space Booking has been Rescheduled.
ar: تمت إعادة جدولة حجز الحيّز.

# BorrowBookforCustomerHeader
source: Here you can request for the book on behalf of member which he/she want to borrow.
ar: هنا يمكنك طلب الكتاب بالنيابة عن العضو الذي يرغب في استعارته.

# AlreadyBookBorrowedforCustomer
source: This book is already borrowed for this member.
ar: هذا الكتاب مُستعار بالفعل لهذا العضو.

# BorrowBookAddforCustomer
source: This book is borrowed on behalf of this member.
ar: هذا الكتاب مُستعار بالنيابة عن هذا العضو.

# BlankComment
source: You can not add Blank Comment
ar: لا يمكنك إضافة تعليق فارغ.

source: No Users Found
ar: تعذر الحصول على أي مستخدمين

# CurrentQtyCannotbeMoreThanTotalQuantity
source: Current Quantity can not be more than Total Quantity .
ar: الكمية الحالية لا يمكن ان تكون أكبر من الكمية الإجمالية.

# SendMessageError
source: Error in sending the message.
ar: خطأ في إرسال الرسالة.

# SendMessageSuccess
source: Message sent successfully.
ar: تم إرسال الرسالة بنجاح.

source: No message.
ar: لا توجد رسالة.

source: Select user to send message
ar: حدد المستخدم لإرسال رسالة

source: Email Sent Failed.
ar: فشل إرسال البريد الإلكتروني.

# BookInvalidCurrentQuantity
source: Book's current quantity can not be less than zero.
ar: كمية الكتب الحالية لا يمكن أن تكون أقل من صفر.

# BookReturnError
source: Error in returning book.
ar: خطأ في إرجاع الكتاب.

# BookReturnSuccess
source: Book is return successfully.
ar: تم إرجاع الكتاب بنجاح.

# NoDelayed
source: No delayed books.
ar: لا توجد كتب متأخرة.

source: No event requests.
ar: لا توجد طلبات فعاليات.

source: No notifications.
ar: لا توجد إشعارات.

# NoReturnToday
source: No books to return for today.
ar: لا توجد كتب ينبغي إرجاعها اليوم.

# FileContentNull
source: File Content cannot be null or empty.
ar: محتوى الملف لا يمكن أن يكون فارغًا.

# FileSizeError
source: File size can't be more than {0} MB.
ar: لا يمكن أن يكون حجم الملف أكبر من {0} ميغا بايت.

source: Invalid file extension.
ar: امتداد ملف غير صالح.

# ValidValueandExtension
source: File Name must have a value and an extension.
ar: اسم الملف لا بد أن يكون له قيمة وامتداد.

# NoInactiveMessage1
source: {0} is already in use so you cannot Inactive this.
ar: {0} قيد الاستخدام بالفعل لذا لا يمكنك إلغاء تنشيطه.

source: Quantity must be numeric.
ar: لا بد أن تكون الكمية رقمية.

# AlreadyBookIsPending
source: This book is already pending for this member.
ar: هذا الكتاب معلق بالفعل لهذا العضو.

source: Invalid Phone Number
ar: رقم الهاتف غير صحيح

# NotifyMeMessage
source: Notification will be sent to you once book is available
ar: سيتم إرسال الإشعار إليك بمجرد توفر الكتاب

# FileSizeClient
source: File size exceeds the maximum size allowed.
ar: يتجاوز حجم الملف الحد الأقصى للحجم المسموح به.

# FileTypeClient
source: The file type of the attempted upload is invalid.
ar: نوع ملف محاولة التحميل غير صالح.

# NoBooksinFavourite
source: There are no books in your favourite list
ar: لا توجد كتب في قائمة المفضلة لديك

source: No Rooms Booked
ar: لا غرف محجوزة

source: No Borrowed Books
ar: لا يوجد كتب مستعارة

# BookingAreaUnavailableTooltip
source: Booking area is unavailable.
ar: مساحة الحجز المُحددة غير متوفرة.

# EmailNotExistInAD
source: Email not exist in Active Directory,Please Contact Administrator
ar: البريد الإلكتروني غير موجود في نشيط دليل ، يرجى الاتصال بمسؤول

# SomethingWentWrong
source: Something went wrong. Please contact system administrator.
ar: هناك خطأ ما. يرجى الاتصال بمسؤول النظام.
